PortiaLabiata/STM32_Stepper/include/stepper.h
#ifndef STEP_H_
#define STEP_H_

#include <stm32f1xx.h>
#include <stm32f1xx_hal.h>
#include <stm32f1xx_hal_rcc.h>
#include <stm32f1xx_hal_gpio.h>
#include <stm32f1xx_hal_tim.h>
#include <stm32f103x6.h>

#include <stdint.h>

#include "circ_buffer.h"

/* Macroses */

#define STEPPER_POLL_FOR_FINISH() while (Stepper_GetState(&stepper) == STEPPER_STATE_RUNNING) ;

/* Magic numbers */

#define GPIO_MASK 0b1111L;
#define RUN_INDEFINETLY -1

typedef enum {
    STEPPER_MODE_WAVE,
    STEPPER_MODE_STEP,
    STEPPER_MODE_HALFSTEP
} StepperModes;

typedef enum {
    STEPPER_DIRECTION_FORWARD,
    STEPPER_DIRECTION_REVERSE
} StepperDirec;

typedef enum {
    STEPPER_STATE_READY,
    STEPPER_STATE_RUNNING,
    STEPPER_STATE_HALTED
} Stepper_State;


typedef struct {
    uint16_t *gpios;
    uint16_t period;
    uint32_t presc;
    Stepper_State __state;
    circular_buffer_t __buffer;
    StepperModes __mode;
    StepperDirec __direc;
    uint32_t __steps_left;
} Stepper_InitStruct_t;

/* Global variables */

/* Control functions */

void Stepper_Init(Stepper_InitStruct_t *stepper);
void Stepper_Step(Stepper_InitStruct_t *stepper, int steps, StepperDirec direc, StepperModes mode);
void Stepper_Halt(Stepper_InitStruct_t *stepper);
void Stepper_Resume(Stepper_InitStruct_t *stepper);
void Stepper_PollForFinish(Stepper_InitStruct_t *stepper);

/* Getters and setters */

StepperModes Stepper_GetMode(Stepper_InitStruct_t stepper);
StepperDirec Stepper_GetDirec(Stepper_InitStruct_t stepper);
Stepper_State Stepper_GetState(Stepper_InitStruct_t *stepper);
void Stepper_SetState(Stepper_InitStruct_t *stepper, Stepper_State state);

/* Peripherals configuration */

void TIM3_Config(TIM_TypeDef *tim, uint16_t period, uint32_t presc);
void GPIO_Config(uint16_t *iPins);
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef* htim);

#endif